In [1]:
import numpy as np
import pandas as pd

In [2]:
serie = pd.Series([1980, 1981, 1982, 1983])
serie

0    1980
1    1981
2    1982
3    1983
dtype: int64

In [5]:
print(serie.values.sum())
print(serie.index)

7926
RangeIndex(start=0, stop=4, step=1)

In [6]:
#Making a series from an np.array()
serie = pd.Series(np.random.rand(10))
serie

0    0.682159
1    0.244681
2    0.341863
3    0.512534
4    0.734651
5    0.871474
6    0.590249
7    0.655079
8    0.134198
9    0.314893
dtype: float64

In [7]:
#Now with a dictionary

dicti = {'the square of {} is'.format(i) :i*i for i in range(12) }
dicti

{'the square of 0 is': 0,
 'the square of 1 is': 1,
 'the square of 2 is': 4,
 'the square of 3 is': 9,
 'the square of 4 is': 16,
 'the square of 5 is': 25,
 'the square of 6 is': 36,
 'the square of 7 is': 49,
 'the square of 8 is': 64,
 'the square of 9 is': 81,
 'the square of 10 is': 100,
 'the square of 11 is': 121}

In [8]:
dicti_serie = pd.Series(dicti)
dicti_serie

the square of 0 is       0
the square of 1 is       1
the square of 2 is       4
the square of 3 is       9
the square of 4 is      16
the square of 5 is      25
the square of 6 is      36
the square of 7 is      49
the square of 8 is      64
the square of 9 is      81
the square of 10 is    100
the square of 11 is    121
dtype: int64

In [9]:
d = [np.random.randint(50, size=(10))]

In [11]:
df = pd.DataFrame(d)
df

   0   1   2   3  4  5   6   7   8   9
0  4  48  25  38  1  3  29  27  27  45

In [15]:
df = df.T
df

    0
0   4
1  48
2  25
3  38
4   1
5   3
6  29
7  27
8  27
9  45

In [16]:
#Adding columns
df['exp'] = 5

In [19]:
df['loss'] = [(i+1)*np.e for i in range(10)]
df

    0  exp       loss
0   4    5   2.718282
1  48    5   5.436564
2  25    5   8.154845
3  38    5  10.873127
4   1    5  13.591409
5   3    5  16.309691
6  29    5  19.027973
7  27    5  21.746255
8  27    5  24.464536
9  45    5  27.182818

In [20]:
df['test'] = df['loss']*51
df

    0  exp       loss         test
0   4    5   2.718282   138.632373
1  48    5   5.436564   277.264747
2  25    5   8.154845   415.897120
3  38    5  10.873127   554.529493
4   1    5  13.591409   693.161866
5   3    5  16.309691   831.794240
6  29    5  19.027973   970.426613
7  27    5  21.746255  1109.058986
8  27    5  24.464536  1247.691359
9  45    5  27.182818  1386.323733

In [21]:
df.loss

0     2.718282
1     5.436564
2     8.154845
3    10.873127
4    13.591409
5    16.309691
6    19.027973
7    21.746255
8    24.464536
9    27.182818
Name: loss, dtype: float64

In [22]:
df.columns = ['NewName1','NewName2','Newname3','NewName4']
df

   NewName1  NewName2   Newname3     NewName4
0         4         5   2.718282   138.632373
1        48         5   5.436564   277.264747
2        25         5   8.154845   415.897120
3        38         5  10.873127   554.529493
4         1         5  13.591409   693.161866
5         3         5  16.309691   831.794240
6        29         5  19.027973   970.426613
7        27         5  21.746255  1109.058986
8        27         5  24.464536  1247.691359
9        45         5  27.182818  1386.323733

In [23]:
c = df.drop([2,4,5], axis =0)
c

   NewName1  NewName2   Newname3     NewName4
0         4         5   2.718282   138.632373
1        48         5   5.436564   277.264747
3        38         5  10.873127   554.529493
6        29         5  19.027973   970.426613
7        27         5  21.746255  1109.058986
8        27         5  24.464536  1247.691359
9        45         5  27.182818  1386.323733

In [24]:
c.drop(['NewName1'], axis=1, inplace= True)
c

   NewName2   Newname3     NewName4
0         5   2.718282   138.632373
1         5   5.436564   277.264747
3         5  10.873127   554.529493
6         5  19.027973   970.426613
7         5  21.746255  1109.058986
8         5  24.464536  1247.691359
9         5  27.182818  1386.323733

In [26]:
df['Newname3'].mean()

14.950550056524747

In [28]:
df['NewName4'].mean()

762.4780528827621

In [29]:
df['NewName4'].std()

419.73035396401104

In [30]:
df['Newname3'].std()

8.230006940470806

In [36]:
df.loc[1]

NewName1     48.000000
NewName2      5.000000
Newname3      5.436564
NewName4    277.264747
Name: 1, dtype: float64

In [37]:
df.loc[1:3]

   NewName1  NewName2   Newname3    NewName4
1        48         5   5.436564  277.264747
2        25         5   8.154845  415.897120
3        38         5  10.873127  554.529493

In [38]:
df.loc[2:6, 'Newname3']

2     8.154845
3    10.873127
4    13.591409
5    16.309691
6    19.027973
Name: Newname3, dtype: float64

In [40]:
#dealing with absent data
df = pd.DataFrame({'VarA':['a', None, 'cc'],
                    'VarB':[10,20,None],
                    'VarC':[12,32,45]})

df

   VarA  VarB  VarC
0     a  10.0    12
1  None  20.0    32
2    cc   NaN    45

In [44]:
df.isnull()

    VarA   VarB   VarC
0  False  False  False
1   True  False  False
2  False   True  False

In [47]:
df['VarB'].fillna(df['VarB'].mean(), inplace =True)
df

   VarA  VarB  VarC
0     a  10.0    12
1  None  20.0    32
2    cc  15.0    45